
// okinawan hepburn romaji
pub const ROMAJI_TO_HIRAGANA_TABLE: &'static [(&str, &str)] = &[
    ("'nn","っん"),("'wa","っわ"),("'we","っゑ"),("'wi","っゐ"),("'wo","っを"),("'ya","っや"),("'yo","っよ"),("'yu","っゆ"),("a","あ"),("ba","ば"),("be","べ"),("bi","び"),("bo","ぼ"),("bu","ぶ"),("bya","びゃ"),("byo","びょう"),("byu","びゅ"),("cha","ちゃ"),("che","ちぇ"),("chi","ち"),("cho","ちょ"),("chu","ちゅ"),("da","だ"),("de","で"),("di","でぃ"),("do","ど"),("du","どぅ"),("dya","ぢゃ"),("dye","ぢぇ"),("dyi","ぢぃ"),("dyo","ぢょ"),("dyu","ぢゅ"),("e","え"),("fa","ふぁ"),("fe","ふぇ"),("fi","ふぃ"),("fo","ふぉ"),("fu","ふ"),("ga","が"),("ge","げ"),("gi","ぎ"),("go","ご"),("gu","ぐ"),("gwa","ぐゎ"),("gwe","ぐぇ"),("gwi","ぐぃ"),("gwo","ぐぉ"),("gya","ぎゃ"),("gyo","ぎょ"),("gyu","ぎゅ"),("ha","は"),("he","へ"),("hi","ひ"),("ho","ほ"),("hu","ふ"),("hya","ひゃ"),("hyo","ひょ"),("hyu","ひゅ"),("i","い"),("ja","じゃ"),("je","じぇ"),("ji","じ"),("jo","じょ"),("ju","じゅ"),("ka","か"),("ke","け"),("ki","き"),("ko","こ"),("ku","く"),("kwa","くゎ"),("kwe","くぇ"),("kwi","くぃ"),("kwo","くぉ"),("kya","きゃ"),("kyo","きょ"),("kyu","きゅ"),("ma","ま"),("me","め"),("mi","み"),("mo","も"),("mu","む"),("mya","みゃ"),("myo","みょ"),("myu","みゅ"),("na","な"),("ne","ね"),("ni","に"),("n'","ん"),("nn","ん"),("no","の"),("nu","ぬ"),("nya","にゃ"),("nyo","にょ"),("nyu","にゅ"),("o","お"),("pa","ぱ"),("pe","ぺ"),("pi","ぴ"),("po","ぽ"),("pu","ぷ"),("pya","ぴゃ"),("pyo","ぴょお"),("pyu","ぴゅ"),("qnn","っん"),("qwa","っわ"),("qwe","っゑ"),("qwi","っゐ"),("qwo","っを"),("qya","っや"),("qyo","っよ"),("qyu","っゆ"),("ra","ら"),("re","れ"),("ri","り"),("ro","ろ"),("ru","る"),("rya","りゃ"),("ryo","りょ"),("ryu","りゅ"),("sa","さ"),("se","せ"),("sha","しゃ"),("she","しぇ"),("shi","し"),("sho","しょ"),("shu","しゅ"),("si","すぃ"),("so","そ"),("su","す"),("ta","た"),("te","て"),("ti","てぃ"),("to","と"),("tsa","つぁ"),("tse","つぇ"),("tsi","つぃ"),("tso","つぉ"),("tsu","つ"),("tu","とぅ"),("u","う"),("wa","わ"),("we","ゑ"),("wi","ゐ"),("wo","を"),("wu","をぉ"),("xtsu","っ"),("xtu","っ"),("ya","や"),("ye","えぇ"),("yi","いぃ"),("yo","よ"),("yu","ゆ"),("za","ざ"),("ze","ぜ"),("zi","ずぃ"),("zo","ぞ"),("zu","ず")
];

// okinawan hiragana
pub const HIRAGANA_TO_ROMAJI_TABLE: &'static [(&str, &str)] = &[
    ("あ","a"),("い","i"),("いぃ","yi"),("う","u"),("え","e"),("えぇ","ye"),("お","o"),("か","ka"),("が","ga"),("き","ki"),("きゃ","kya"),("きゅ","kyu"),("きょ","kyo"),("ぎ","gi"),("ぎゃ","gya"),("ぎゅ","gyu"),("ぎょ","gyo"),("く","ku"),("くぃ","kwi"),("くぇ","kwe"),("くぉ","kwo"),("くゎ","kwa"),("ぐ","gu"),("ぐぃ","gwi"),("ぐぇ","gwe"),("ぐぉ","gwo"),("ぐゎ","gwa"),("け","ke"),("げ","ge"),("こ","ko"),("ご","go"),("さ","sa"),("ざ","za"),("し","shi"),("しぇ","she"),("しゃ","sha"),("しゅ","shu"),("しょ","sho"),("じ","ji"),("じぇ","je"),("じゃ","ja"),("じゅ","ju"),("じょ","jo"),("す","su"),("すぃ","si"),("ず","zu"),("ずぃ","zi"),("せ","se"),("ぜ","ze"),("そ","so"),("ぞ","zo"),("た","ta"),("だ","da"),("ち","chi"),("ちぇ","che"),("ちゃ","cha"),("ちゅ","chu"),("ちょ","cho"),("ぢぃ","dyi"),("ぢぇ","dye"),("ぢゃ","dya"),("ぢゅ","dyu"),("ぢょ","dyo"),("っや","'ya"),("っゆ","'yu"),("っよ","'yo"),("っわ","'wa"),("っゐ","'wi"),("っゑ","'we"),("っを","'wo"),("っん","'n"),("つ","tsu"),("つぁ","tsa"),("つぃ","tsi"),("つぇ","tse"),("つぉ","tso"),("て","te"),("てぃ","ti"),("で","de"),("でぃ","di"),("と","to"),("とぅ","tu"),("ど","do"),("どぅ","du"),("な","na"),("に","ni"),("にゃ","nya"),("にゅ","nyu"),("にょ","nyo"),("ぬ","nu"),("ね","ne"),("の","no"),("は","ha"),("ば","ba"),("ぱ","pa"),("ひ","hi"),("ひゃ","hya"),("ひゅ","hyu"),("ひょ","hyo"),("び","bi"),("びゃ","bya"),("びゅ","byu"),("びょう","byo"),("ぴ","pi"),("ぴゃ","pya"),("ぴゅ","pyu"),("ぴょお","pyo"),("ふ","fu"),("ふ","fu"),("ふぁ","fa"),("ふぃ","fi"),("ふぇ","fe"),("ふぉ","fo"),("ぶ","bu"),("ぷ","pu"),("へ","he"),("べ","be"),("ぺ","pe"),("ほ","ho"),("ぼ","bo"),("ぽ","po"),("ま","ma"),("み","mi"),("みゃ","mya"),("みゅ","myu"),("みょ","myo"),("む","mu"),("め","me"),("も","mo"),("や","ya"),("ゆ","yu"),("よ","yo"),("ら","ra"),("り","ri"),("りゃ","rya"),("りゅ","ryu"),("りょ","ryo"),("る","ru"),("れ","re"),("ろ","ro"),("わ","wa"),("ゐ","wi"),("ゑ","we"),("を","wo"),("をぉ","wu"),("ん","n")
];

// hiragana rows

pub const A_ROW: &'static [(&str, &str)] = &[
    ("あ","あ"),("い","い"),("う","う"),("え","え"),("お","お")
];

pub const YA_ROW: &'static [(&str, &str)] = &[
    ("あ","や"),("い","いぃ"),("う","ゆ"),("え","いぇ"),("お","よ")
];

pub const WA_ROW: &'static [(&str, &str)] = &[
    ("あ","わ"),("い","ゐ"),("う","をぅ"),("え","ゑ"),("お","を")
];

// qyi and qye do not exist
pub const QYA_ROW: &'static [(&str, &str)] = &[
    ("あ","っや"),("う","っゆ"),("お","っよ")
];

// qwu does not exist
pub const QWA_ROW: &'static [(&str, &str)] = &[
    ("あ","っわ"),("い","っゐ"),("え","っゑ"),("お","っを")
];

pub const QA_ROW: &'static [(&str, &str)] = &[
    ("あ","っあ"),("い","っい"),("う","っう"),("え","っえ"),("お","っお")
];

pub const KA_ROW: &'static [(&str, &str)] = &[
    ("あ","か"),("い","き"),("う","く"),("え","け"),("お","こ")
];

// kye and kyi do not exits
pub const KYA_ROW: &'static [(&str, &str)] = &[
    ("あ","きゃ"),("う","きゅ"),("お","きょ")
];

// kwu does not exist
pub const KWA_ROW: &'static [(&str, &str)] = &[
    ("あ","くぁ"),("い","くぃ"),("え","くぇ"),("お","くぉ")
];

pub const GA_ROW: &'static [(&str, &str)] = &[
    ("あ","が"),("い","ぎ"),("う","ぐ"),("え","げ"),("お","ご")
];

// gyi and gye do not exist
pub const GYA_ROW: &'static [(&str, &str)] = &[
    ("あ","ぎゃ"),("う","ぎゅ"),("お","ぎょ")
];

// gwu does not exist
pub const GWA_ROW: &'static [(&str, &str)] = &[
    ("あ","ぐぁ"),("い","ぐぃ"),("え","ぐぇ"),("お","ぐぉ")
];

pub const SA_ROW: &'static [(&str, &str)] = &[
    ("あ","さ"),("い","すぃ"),("う","す"),("え","せ"),("お","そ")
];

pub const SHA_ROW: &'static [(&str, &str)] = &[
    ("あ","しゃ"),("い","し"),("う","しゅ"),("え","しぇ"),("お","しょ")
];

pub const ZA_ROW: &'static [(&str, &str)] = &[
    ("あ","ざ"),("い","ずぃ"),("う","ず"),("え","ぜ"),("お","ぞ")
];

pub const JA_ROW: &'static [(&str, &str)] = &[
    ("あ","じゃ"),("い","じ"),("う","じゅ"),("え","じぇ"),("お","じょ")
];

pub const TA_ROW: &'static [(&str, &str)] = &[
    ("あ","た"),("い","てぃ"),("う","とぅ"),("え","て"),("お","と")
];

pub const DA_ROW: &'static [(&str, &str)] = &[
    ("あ","だ"),("い","でぃ"),("う","どぅ"),("え","で"),("お","ど")
];

pub const TSA_ROW: &'static [(&str, &str)] = &[
    ("あ","つぁ"),("い","つぃ"),("う","つ"),("え","つぇ"),("お","つぉ")
];

pub const CHA_ROW: &'static [(&str, &str)] = &[
    ("あ","ちゃ"),("い","ち"),("う","ちゅ"),("え","ちぇ"),("お","ちょ")
];

pub const NA_ROW: &'static [(&str, &str)] = &[
    ("あ","な"),("い","に"),("う","ぬ"),("え","ね"),("お","の")
];

pub const HA_ROW: &'static [(&str, &str)] = &[
    ("あ","は"),("い","ひ"),("う","ふ"),("え","へ"),("お","ほ")
];

pub const FA_ROW: &'static [(&str, &str)] = &[
    ("あ","ふぁ"),("い","ふぃ"),("う","ふ"),("え","ふぇ"),("お","ふぉ")
];

pub const BA_ROW: &'static [(&str, &str)] = &[
    ("あ","ば"),("い","び"),("う","ぶ"),("え","べ"),("お","ぼ")
];

pub const PA_ROW: &'static [(&str, &str)] = &[
    ("あ","ぱ"),("い","ぴ"),("う","ぷ"),("え","ぺ"),("お","ぽ")
];

pub const MA_ROW: &'static [(&str, &str)] = &[
    ("あ","ま"),("い","み"),("う","む"),("え","め"),("お","も")
];

pub const RA_ROW: &'static [(&str, &str)] = &[
    ("あ","ら"),("い","り"),("う","る"),("え","れ"),("お","ろ")
];

// kye and kyi do not exits
pub const NYA_ROW: &'static [(&str, &str)] = &[
    ("あ","にゃ"),("う","にゅ"),("お","にょ")
];

// kye and kyi do not exits
pub const HYA_ROW: &'static [(&str, &str)] = &[
    ("あ","ひゃ"),("う","ひゅ"),("お","ひょ")
];

// mye and myi do not exits
pub const MYA_ROW: &'static [(&str, &str)] = &[
    ("あ","きゃ"),("う","きゅ"),("お","きょ")
];

// kye and kyi do not exits
pub const RYA_ROW: &'static [(&str, &str)] = &[
    ("あ","りゃ"),("う","りゅ"),("お","りょ")
];

pub const HIRAGANA_TO_ROW_TABLE: &'static [(&str, &'static [(&str, &str)])] = &[
    ("い",A_ROW),("いぃ",YA_ROW),("う",A_ROW),("え",A_ROW),("えぇ",YA_ROW),("お",A_ROW),("か",KA_ROW),("が",GA_ROW),("き",KA_ROW),("きゃ",KYA_ROW),("きゅ",KYA_ROW),("きょ",KYA_ROW),("ぎ",GA_ROW),("ぎゃ",GYA_ROW),("ぎゅ",GYA_ROW),("ぎょ",GYA_ROW),("く",KA_ROW),("くぁ",KWA_ROW),("くぃ",KWA_ROW),("くぇ",KWA_ROW),("くぉ",KWA_ROW),("ぐ",GA_ROW),("ぐぁ",GWA_ROW),("ぐぃ",GWA_ROW),("ぐぇ",GWA_ROW),("ぐぉ",GWA_ROW),("け",KA_ROW),("げ",GA_ROW),("こ",KA_ROW),("ご",KA_ROW),("さ",SA_ROW),("ざ",ZA_ROW),("し",SHA_ROW),("しぇ",SHA_ROW),("しゃ",SHA_ROW),("しゅ",SHA_ROW),("しょ",SHA_ROW),("じ",JA_ROW),("じぇ",JA_ROW),("じゃ",JA_ROW),("じゅ",JA_ROW),("じょ",JA_ROW),("す",SA_ROW),("すぃ",SA_ROW),("ず",ZA_ROW),("ずぃ",ZA_ROW),("せ",SA_ROW),("ぜ",ZA_ROW),("そ",SA_ROW),("ぞ",ZA_ROW),("た",TA_ROW),("だ",DA_ROW),("ち",CHA_ROW),("ちぇ",CHA_ROW),("ちゃ",CHA_ROW),("ちゅ",CHA_ROW),("ちょ",CHA_ROW),("っあ",QA_ROW),("っい",QA_ROW),("っう",QA_ROW),("っえ",QA_ROW),("っお",QA_ROW),("っや",QYA_ROW),("っゆ",QYA_ROW),("っよ",QYA_ROW),("っわ",QWA_ROW),("っゐ",QWA_ROW),("っゑ",QWA_ROW),("っを",QWA_ROW),("つ",TSA_ROW),("つぁ",TSA_ROW),("つぃ",TSA_ROW),("つぇ",TSA_ROW),("つぉ",TSA_ROW),("て",TA_ROW),("てぃ",TA_ROW),("で",DA_ROW),("でぃ",DA_ROW),("と",TA_ROW),("とぅ",TA_ROW),("ど",DA_ROW),("どぅ",DA_ROW),("な",NA_ROW),("に",NA_ROW),("にゃ",NA_ROW),("にゅ",NA_ROW),("にょ",NA_ROW),("ぬ",NA_ROW),("ね",NA_ROW),("の",NA_ROW),("は",HA_ROW),("ば",BA_ROW),("ぱ",PA_ROW),("ひ",HA_ROW),("ひゃ",HYA_ROW),("ひゅ",HYA_ROW),("ひょ",HYA_ROW),("び",BA_ROW),("ぴ",PA_ROW),("ふ",FA_ROW),("ふぁ",FA_ROW),("ふぃ",FA_ROW),("ふぇ",FA_ROW),("ふぉ",FA_ROW),("ぶ",BA_ROW),("ぷ",PA_ROW),("へ",HA_ROW),("べ",BA_ROW),("ぺ",PA_ROW),("ほ",HA_ROW),("ぼ",BA_ROW),("ぽ",PA_ROW),("ま",MA_ROW),("み",MA_ROW),("みゃ",MYA_ROW),("みゅ",MYA_ROW),("みょ",MYA_ROW),("む",MA_ROW),("め",MA_ROW),("も",MA_ROW),("や",YA_ROW),("ゆ",YA_ROW),("よ",YA_ROW),("ら",RA_ROW),("り",RA_ROW),("りゃ",RYA_ROW),("りゅ",RYA_ROW),("りょ",RYA_ROW),("る",RA_ROW),("れ",RA_ROW),("ろ",RA_ROW),("わ",WA_ROW),("ゐ",WA_ROW),("ゑ",WA_ROW),("を",WA_ROW),("をぅ",WA_ROW)
];

// 長音符　ー　ちょうおんぷ

/*
"あ","い","う","え","お",
"っあ","っい","っう","っえ","っお",
"か","き","く","け","こ",
"が","ぎ","ぐ","げ","ご",
"さ","すぃ","す","せ","そ",
"しゃ","し","しゅ","しぇ","しょ",
"ざ","ずぃ","ず","ぜ","ぞ",
"じゃ","じ","じゅ","じぇ","じょ",
"た","てぃ","とぅ","て","と",
"だ","でぃ","どぅ","で","ど",
"つぁ","つぃ","つ","つぇ","つぉ",
"ちゃ","ち","ちゅ","ちぇ","ちょ",
"な","に","ぬ","ね","の",
"は","ひ","へ","ほ",
"ふぁ","ふぃ","ふ","ふぇ","ふぉ",
"ば","び","ぶ","べ","ぼ",
"ぱ","ぴ","ぷ","ぺ","ぽ",
"ま","み","む","め","も",
"ら","り","る","れ","ろ",
"や","いぃ","ゆ","えぇ","よ",
"わ","ゐ","をぅ","ゑ","を",
"っや","っゆ","っよ",
"っわ","っゐ","っゑ","っを",
"きゃ","きゅ","きょ",
"くぁ","くぃ","くぇ","くぉ",
"ぎゃ","ぎゅ","ぎょ",
"ぐぁ","ぐぃ","ぐぇ","ぐぉ",
"にゃ","にゅ","にょ",
"ひゃ","ひゅ","ひょ",
"みゃ","みゅ","みょ",
"りゃ","りゅ","りょ",
"ん",
"っん"

"あ","い","う","え","お","っあ","っい","っう","っえ","っお","か","き","く","け","こ","が","ぎ","ぐ","げ","ご","さ","すぃ","す","せ","そ","しゃ","し","しゅ","しぇ","しょ","ざ","ずぃ","ず","ぜ","ぞ","じゃ","じ","じゅ","じぇ","じょ","た","てぃ","とぅ","て","と","だ","でぃ","どぅ","で","ど","つぁ","つぃ","つ","つぇ","つぉ","ちゃ","ち","ちゅ","ちぇ","ちょ","な","に","ぬ","ね","の","は","ひ","へ","ほ","ふぁ","ふぃ","ふ","ふぇ","ふぉ","ば","び","ぶ","べ","ぼ","ぱ","ぴ","ぷ","ぺ","ぽ","ま","み","む","め","も","ら","り","る","れ","ろ","や","いぃ","ゆ","えぇ","よ","わ","ゐ","をぅ","ゑ","を","っや","っゆ","っよ","っわ","っゐ","っゑ","っを","きゃ","きゅ","きょ","くぁ","くぃ","くぇ","くぉ","ぎゃ","ぎゅ","ぎょ","ぐぁ","ぐぃ","ぐぇ","ぐぉ","にゃ","にゅ","にょ","ひゃ","ひゅ","ひょ","みゃ","みゅ","みょ","りゃ","りゅ","りょ","ん","っん"



"あ","い","いぃ","う","え","えぇ","お","か","が","き","きゃ","きゅ","きょ","ぎ","ぎゃ","ぎゅ","ぎょ","く","くぁ","くぃ","くぇ","くぉ","ぐ","ぐぁ","ぐぃ","ぐぇ","ぐぉ","け","げ","こ","ご","さ","ざ","し","しぇ","しゃ","しゅ","しょ","じ","じぇ","じゃ","じゅ","じょ","す","すぃ","ず","ずぃ","せ","ぜ","そ","ぞ","た","だ","ち","ちぇ","ちゃ","ちゅ","ちょ","っあ","っい","っう","っえ","っお","っや","っゆ","っよ","っわ","っゐ","っゑ","っを","っん","つ","つぁ","つぃ","つぇ","つぉ","て","てぃ","で","でぃ","と","とぅ","ど","どぅ","な","に","にゃ","にゅ","にょ","ぬ","ね","の","は","ば","ぱ","ひ","ひゃ","ひゅ","ひょ","び","ぴ","ふ","ふぁ","ふぃ","ふぇ","ふぉ","ぶ","ぷ","へ","べ","ぺ","ほ","ぼ","ぽ","ま","み","みゃ","みゅ","みょ","む","め","も","や","ゆ","よ","ら","り","りゃ","りゅ","りょ","る","れ","ろ","わ","ゐ","ゑ","を","を","ん"
*/
