use std::cmp::Ordering::{Equal,Greater,Less};

pub fn lookup(s: &str, table: &'static [(&str,&str)]) -> Option<usize> {
    match table.binary_search_by(|&(key, _)| {
        if s == key { Equal }
        else if key < s { Less }
        else { Greater }
    }) {
        Ok(i) => Some(i),
        Err(_) => None,
    }
}

pub fn is_consonant(s: &str) -> bool {
    s.len() == 1 && !["a","e","i","n","o","u","y"].contains(&s)
}

pub const HIRAGANA_TO_VOWEL_TABLE: &'static [(&str, &str)] = &[
    ("あ","あ"),("い","い"),("う","う"),("え","え"),("お","お"),("か","あ"),("が","あ"),("き","い"),("ぎ","い"),("く","う"),("ぐ","う"),("け","え"),("げ","え"),("こ","お"),("ご","お"),("さ","あ"),("ざ","あ"),("し","い"),("じ","い"),("す","う"),("ず","う"),("せ","え"),("ぜ","え"),("そ","お"),("ぞ","お"),("た","あ"),("だ","あ"),("ち","い"),("ぢ","い"),("つ","う"),("づ","う"),("て","え"),("で","え"),("と","お"),("ど","お"),("な","あ"),("に","い"),("ぬ","う"),("ね","え"),("の","お"),("は","あ"),("ば","あ"),("ば","え"),("ぱ","あ"),("ひ","い"),("び","い"),("ぴ","い"),("ふ","う"),("ぶ","う"),("ぷ","う"),("へ","え"),("べ","え"),("ほ","お"),("ぼ","お"),("ぽ","お"),("ま","あ"),("み","い"),("む","う"),("め","え"),("も","お"),("ゃ","あ"),("や","あ"),("ゅ","う"),("ゆ","う"),("ょ","お"),("よ","お"),("ら","あ"),("り","い"),("る","う"),("れ","え"),("ろ","お"),("わ","あ"),("を","お")
];
/*
pub const HIRAGANA_TO_VOWEL_TABLE: &'static [(&str, &str)] = &[
    ("あ","あ"),("か","あ"),("さ","あ"),("た","あ"),("な","あ"),("は","あ"),("ま","あ"),("や","あ"),("ら","あ"),("わ","あ"),("が","あ"),("ざ","あ"),("だ","あ"),("ば","あ"),("ぱ","あ"),("ゃ","あ"),("い","い"),("き","い"),("し","い"),("ち","い"),("に","い"),("ひ","い"),("み","い"),("り","い"),("ぎ","い"),("じ","い"),("ぢ","い"),("び","い"),("ぴ","い"),("う","う"),("く","う"),("す","う"),("つ","う"),("ぬ","う"),("ふ","う"),("む","う"),("ゆ","う"),("る","う"),("ぐ","う"),("ず","う"),("づ","う"),("ぶ","う"),("ぷ","う"),("ゅ","う"),("え","え"),("け","え"),("せ","え"),("て","え"),("ね","え"),("へ","え"),("め","え"),("れ","え"),("げ","え"),("ぜ","え"),("で","え"),("ば","え"),("べ","え"),("お","お"),("こ","お"),("そ","お"),("と","お"),("の","お"),("ほ","お"),("も","お"),("よ","お"),("ろ","お"),("を","お"),("ご","お"),("ぞ","お"),("ど","お"),("ぼ","お"),("ぽ","お"),("ょ","お")
];
*/

// 長音符　ー　ちょうおんぷ
